import { MockMethod } from "vite-plugin-mock";

const health_knowledge_data_mock = [
  {
    id: 1,
    title: "测试的养生知识",
    creator_name: "张三",
    reviewer_name: null,
    review_status: 1, // 1: 未提交, 2: 审核中, 3: 审核通过, 4: 审核拒绝
    review_status_name: "未提交",
    create_time: "2023-04-01 10:00:00",
    update_time: "2023-04-10 10:00:00",
    review_time: null,
    content:
      '<h1>测试一下</h1><p>“专家说得提升宝宝免疫力，到底得怎么做”“气温变化太快了，真的怕公婆又生病”……这阵子，记者和宝爸宝妈们聊天，都逃不开这些“家长里短”的话题。</p><p>又到了为大家健康“操心”的时候了。4月7日，记者特意赶到湖南中医药大学第二附属医院，跟相关专家面对面聊了会。没想到，“吃”的话题，成了“主题”。一起来了解一下吗？</p><p><img src="https://pic.rmb.bdstatic.com/bjh/news/f1cf89df0f0a108e0a603526d116247f.gif" alt="" data-href="" style=""/></p><p><br></p><p>@宝爸宝妈：五谷杂粮、蛋白质、维生素都得“安排上”</p><p><br></p><p>“春季是适于儿童生长发育的黄金季节，但每年春季的天气变化反复不定，乍暖还寒，所以也是宝宝感冒和流行性疾病的高发期。”湖南中医药大学第二附属医院（湖南省中医院）儿科主任詹红艳其实最近也“接待”了不少前来问诊的家长朋友，这句话她基本都是“挂在嘴边”。</p><p>那到底怎么做呢？她认为，宝宝们的营养，重在均衡，所以更得讲究“全面”。饮食以清淡，富有蛋白质、维生素和微量元素及易消化食物为主，不要让孩子吃过于油腻的烧烤油煎食品。烹调方式上，尽量采用汤、粥、羹等形式，以利于脾胃消化和吸收。</p><p>接下来，请让咱具体分解！</p><p><img src="https://pic.rmb.bdstatic.com/bjh/news/4fa2014835bf11a6bf38613e2cb9fbfd.gif" alt="" data-href="" style=""/></p><p><br></p><p>首先，要给孩子多吃些五谷杂粮。“比方说：小米有健脾和胃作用，适合脾胃虚热的孩子，小米粥上的一层黏稠的“米油”营养极为丰富，对恢复胃肠消化功能很有帮助；玉米有健脾利湿，开胃益智作用；薏米有健脾补肺，清热利湿作用；黄豆有健脾益气作用；赤豆有健脾补血作用，特别适合脾虚兼有贫血的孩子。”詹红艳一口气说了这么多，还好记者全部都记下来了。</p><p>其次，经过一个冬季，宝宝此时易缺钙，加之春季生长发育加速，需钙量增加。詹红艳认为，在饮食上应给宝宝多选用含钙丰富的食品，如牛奶、豆制品、骨头汤、鱼、虾、芝麻等。同时，宝宝春天生长发育加速，对优质蛋白的需求也随之增加，可多选用鸡蛋、鱼、虾、鸡肉、牛肉、豆制品、小米、红豆等。</p><p>“平衡摄入富含维生素的食物”，是詹红艳特别强调的。据她介绍，维生素缺乏不仅容易引起感冒、呼吸道疾病和胃肠道疾病，还容易出现以下情况——缺乏维生素A会出现干眼病、皮肤干燥和呼吸道疾病；缺乏维生素B可患唇炎、口角炎、舌炎；缺乏维生素D会缺钙、患佝偻病等。</p><p>“维生素也在儿童生长发育中起到重要作用，缺乏维生素也影响儿童发育，尤其在春季身高发育黄金时期，更应注重维生素的摄入。”她针对以上情况，提了点好建议：</p><p><img src="https://pic.rmb.bdstatic.com/bjh/news/e2156440885eabcd69b0a7c6e5f8d6ba.gif" alt="" data-href="" style=""/></p><p><br></p><p>·维生素A在鱼肝油和深绿色、深黄色蔬菜及水果中含量较多；</p><p>·维生素B富含于动物肝脏、瘦肉、禽蛋、牛奶、豆制品、谷物、胡萝卜、鱼、蔬菜等食物中；</p><p>·维生素C在绿色蔬菜和水果中含量较多；</p><p>·维生素D在鱼肝油、动物肝脏、蛋黄和牛奶中含量较多；</p><p>·维生素E在麦、米胚中的油脂，蛋、肉类中含量较多。</p><p>她告诉记者，这俗话说：“百草回芽，百病发作”， 春季气温回暖，各种病菌和病毒异常活跃，疾病容易侵袭年幼体弱的儿童。强身才能健体，要让宝宝远离疾病，茁壮成长，家长除了采取必要的防护措施，顺应春季养生保健，最根本的还在于给孩子补充营养，增强体质。</p><p>@孝顺子女：老人家的饭桌上还得多点“绿”</p><p>“春季来临，万物复苏，人体的生理机能也为适应大自然的变化而活跃起来。老年人做好春季养生，有利于增强体质，预防疾病，达到延年益寿的效果。”谈及老年朋友如何养生，湖南中医药大学第二附属医院（湖南省中医院）大内科主任毛以林如是说。</p><p>春天对应人体的脏腑为肝，其色青，肝主生发而恶抑郁，春季养生首以“养肝”之生发之气为要。利用春季大自然“发陈”之时，借阳气上升、人体新陈代谢旺盛之机，采用科学的养生方式，可起到很好的效果，综上所述，老人家在春季应该多吃绿色且具有生发之气的食物。</p><p><img src="https://pic.rmb.bdstatic.com/bjh/news/5943509167a9bddf83f3d48e738252f0.gif" alt="" data-href="" style=""/></p><p><br></p><p>·报春菜——荠菜：</p><p>民谚唱，“三月三，荠菜当灵丹。”荠菜被古人誉为“灵丹妙药”。《本草纲目》中写道：“荠生济济，故谓之荠。”荠菜具有健脾利水、止血明目的功效，其花与籽尤善止血，可以治疗痢疾、水肿、便血、目赤疼痛等病症。</p><p>·树上的蔬菜——香椿</p><p>香椿即香椿树的嫩芽。我国食用香椿由来已久，早在汉朝就与荔一起作为南北两大贡品，深受皇上及宫廷贵人的喜爱，为宴宾之名贵佳肴。</p><p>《日华子本草》记载：止泄精尿血、暖腰膝、除心腥痼冷、胸中痹冷、痃癖气及腹痛等，食之肥白人。椿叶：苦，平。消炎，解毒，杀虫。用于痔疮，痢疾。有补虚壮阳固精、补肾养发生发、消炎止血止痛、行气理血健胃等作用。</p><p>通俗地说，凡肾阳虚衰、腰膝冷痛、遗精阳痿、脱发者，最好都试试。</p><p>·水边“贡品”——篱蒿</p><p>篱蒿学名狭叶艾，又名芦蒿、水蒿、青艾等，野生的篱蒿均生长在湖泊草滩岸边附近。</p><p>《神农本草经》及《本草纲目》中称为“白蒿”：性平，味甘、辛,具有平抑肝火、健体补虚、清热解毒、利胆退黄之功效，主治肝胆湿热、脾虚纳滞、胸腹胀满等病症。根茎含淀粉量高，可充当肝脏贮备肝糖而起解毒的作用。</p><p>·山八珍之一——春笋</p><p>所谓“尝鲜无不道春笋”，笋在生活中再常见不过了。春笋最嫩、最鲜，爽脆更是得自天成。</p><p>中医认为，笋味甘，微寒，无毒，具有开胃健脾、消痰、清心火、通便等功效。所以，它不仅美味，更是功劳“大大的”。</p><p>“春菜一般人群都可以食用。但要注意的是，春笋、荠菜、香椿都有个特点：见风就长。从食物性味来说，该类食物多属动风、生火之物，因此而为发物。”毛以林提醒，春季更是过敏高发季节，此前因此过敏的人，这时候还是要管住嘴，切莫因贪吃、好吃而惹麻烦才行。</p>'
  },
  {
    id: 2,
    title: "测试的养生知识22",
    creator_name: "李四",
    reviewer_name: "老四",
    review_status: 2, // 1: 未提交, 2: 审核中, 3: 审核通过, 4: 审核拒绝
    review_status_name: "审核中",
    create_time: "2023-04-01",
    update_time: "2023-04-10 10:00:00",
    review_time: null,
    content: "xxxxxxxxxxxxxxx"
  },
  {
    id: 3,
    title: "测试的养生知识xx",
    creator_name: "王五",
    reviewer_name: "老四",
    review_status: 4, // 1: 未提交, 2: 审核中, 3: 审核通过, 4: 审核拒绝
    review_status_name: "审核拒绝",
    create_time: "2023-04-01",
    update_time: "2023-04-10 10:00:00",
    review_time: "2023-04-10",
    content: "xxxxxxxxxxxxxxx"
  },
  {
    id: 4,
    title: "测试的养生知识",
    creator_name: "赵六",
    reviewer_name: null,
    review_status: 1, // 1: 未提交, 2: 审核中, 3: 审核通过, 4: 审核拒绝
    review_status_name: "未提交",
    create_time: "2023-04-01",
    update_time: "2023-04-10 10:00:00",
    review_time: null,
    content: "xxxxxxxxxxxxxxx"
  },
  {
    id: 5,
    title: "测试的养生知识哈哈哈",
    creator_name: "小明",
    reviewer_name: "老四",
    review_status: 3, // 1: 未提交, 2: 审核中, 3: 审核通过, 4: 审核拒绝
    review_status_name: "审核通过",
    create_time: "2023-04-01",
    update_time: "2023-04-10 10:00:00",
    review_time: "2023-04-11",
    content: "xxxxxxxxxxxxxxx"
  }
];

export default [
  {
    url: "/health/knowledge_list",
    method: "get",
    response: () => {
      return {
        success: true,
        data: {
          list: health_knowledge_data_mock,
          total: health_knowledge_data_mock.length
        }
      };
    }
  },
  {
    url: "/health/knowledge_detail",
    method: "get",
    response: options => {
      const query_param = options.query;
      const query_id = query_param.id;
      return {
        success: true,
        data: health_knowledge_data_mock.filter(item => item.id == query_id)[0]
      };
    }
  }
] as MockMethod[];
